from db_creation import *

create_tables()
# drop_tables()

inserts = ""
with open('simple.db.sql', 'r', encoding="utf-8") as file:
    inserts = file.read().split(';')[1:-2]

for i in inserts:
    database.execute_sql(i)

# kvr = Dimension.create(label='KVR')
# with open('kvr.csv', 'r') as file:
#     data = []
#     lines = file.read().lower().split('\n')
#     for l in lines:
#         data.append(l.split(';'))
#
#     for i in data[:-1]:
#         v = Value.create(nvalue=i[1], fvalue=i[0])
#         Dimension_Value.create(value=v, dimension=kvr)


# database.execute_sql("INSERT INTO 'value' (id,nvalue,fvalue,mdx_extra) VALUES (1,NULL,'VALUE',NULL)")
# database.execute_sql("INSERT INTO 'measure_value' (id,value_id,measure_id) VALUES (1,1,1)")
# database.execute_sql("INSERT INTO 'measure' (id,label) VALUES (1,'MEASURES')")
# database.execute_sql("INSERT INTO 'cube' (id,name,tags) VALUES (1,'EXDO01','текущий расходы')")
# database.execute_sql("INSERT INTO 'cube_measure' (measure_id,cube_id) VALUES (1,1)")
#
# dim_t = Dimension.create(label='TERRITORIES')
# dim_bg = Dimension.create(label='BGLEVELS')
# Dimension.create(label='KVR')
# dim_marks = Dimension.create(label='MARKS')
#
# PLACES = {
#     'адыгея': ('67646', '1451', 'республики Адыгеи'),
#     'алания': ('67652', '2507', 'республики Алании'),
#     'алтай': ('67684', '12792', 'республики Алтай'),
#     'алтайский': ('67688', '13781', 'Алтайского края'),
#     'амурская': ('67708', '18776', 'Амурской области'),
#     'архангельская': ('67678', '11867', 'Архангельской области'),
#     'астраханская': ('67645', '1176', 'Астраханской области'),
#     'байконур': ('93015', '93015', 'Байконура'),
#     'башкортостан': ('67655', '3418', 'республики Башкортостан'),
#     'белгородская': ('67721', '22729', 'Белгородской области'),
#     'брянская': ('67719', '22143', 'Брянской области'),
#     'бурятия': ('67691', '15295', 'республики Бурятия'),
#     'владимирская': ('67716', '21258', 'Владимирской области'),
#     'волгоградская': ('67647', '1512', 'Волгоградской области'),
#     'вологодская': ('67674', '10809', 'Вологодской области'),
#     'воронежская': ('67723', '23249', 'Воронежской области'),
#     'дагестан': ('67643', '4', 'республики Дагестан'),
#     'дальневосточный': ('17698', '17698', 'Дальневосточного федерального округа'),
#     'еврейская': ('67705', '18317', 'Еврейской автономной области'),
#     'забайкальский': ('67729', '24584', 'Забайкальского края'),
#     'ивановская': ('67722', '23067', 'Ивановской области'),
#     'ингушетия': ('67649', '2135', 'республики Ингушетия'),
#     'иркутская': ('67682', '12232', 'Иркутской области'),
#     'кабардино-балкарская': ('67651', '2374', 'Кабардино-Балкарской республики'),
#     'калининградская': ('67670', '10293', 'Калининградской области'),
#     'калмыкия': ('67648', '2006', 'Калмыкии'),
#     'калужская': ('67712', '20350', 'Калужской области'),
#     'камчатский': ('67728', '24543', 'Камчатского края'),
#     'карачаево-черкесская': ('67638', '1354', 'Карачаево-Черкесской республики'),
#     'карелия': ('67677', '11627', 'республики Карелия'),
#     'кемеровская': ('67689', '14580', 'Кемеровской области'),
#     'кировская': ('67663', '7726', 'Кировской области'),
#     'коми': ('67673', '10597', 'республики Коми'),
#     'костромская': ('67714', '20774', 'Костромской области'),
#     'краснодарский': ('67644', '749', 'Краснодарского края'),
#     'красноярский': ('67694', '15777', 'Красноярского края'),
#     'крым': ('93010', '91129', 'республики Крым'),
#     'крымский': ('91128', '91128', 'Крымского федерального округа'),
#     'курганская': ('67699', '16921', 'Курганской области'),
#     'курская': ('67710', '19479', 'Курской области'),
#     'ленинградская': ('67676', '11404', 'Ленинградской области'),
#     'липецкая': ('67711', '20018', 'Липецкой области'),
#     'магаданская': ('67703', '18239', 'Магаданской области'),
#     'марий': ('67666', '9301', 'республики Марий Эл'),
#     'мордовия': ('67662', '7265', 'республики Мордовия'),
#     'москва': ('67724', '23783', 'Москвы'),
#     'московская': ('67709', '19100', 'Московской области'),
#     'мурманская': ('67669', '10250', 'Мурманской области'),
#     'ненецкий': ('67672', '10575', 'Ненецкого автономного округа'),
#     'нижегородская': ('67656', '4439', 'Нижегородской области'),
#     'новгородская': ('67675', '11182', 'Новгородской области'),
#     'новосибирская': ('67690', '14804', 'Новосибирской области'),
#     'омская': ('67687', '13356', 'Омской области'),
#     'оренбургская': ('67659', '5483', 'Оренбургской области'),
#     'орловская': ('67726', '24262', 'Орловской области'),
#     'осетия': ('67652', '2507', 'республики Северная Осетия'),
#     'пензенская': ('67667', '9475', 'Пензенской области'),
#     'пермский': ('67727', '24541', 'Пермского края'),
#     'приволжский': ('3417', '3417', 'Приволожского федерального округа'),
#     'приморский': ('67706', '18354', 'Приморского края'),
#     'псковская': ('67671', '10330', 'Псковской области'),
#     'россия': ('2', '2', 'России'),
#     'ростовская': ('67653', '2', 'Ростовской области'),
#     'рф': ('2', '2622', 'России'),
#     'рязанская': ('67720', '22433', 'Рязанской области'),
#     'самарская': ('67658', '5140', 'Самарской области'),
#     'санкт-петербург': ('67639', '11755', 'Санкт-Петербурга'),
#     'саратовская': ('67665', '8860', 'Саратовской области'),
#     'саха': ('67642', '17699', 'республики Саха'),
#     'сахалинская': ('67704', '18294', 'Сахалинской области'),
#     'свердловская': ('67698', '16827', 'Свердловской области'),
#     'севастополь': ('93011', '91139', 'Севастополя'),
#     'северо-западный': ('10249', '10249', 'Северо-Западного федерального округа'),
#     'северо-кавказский': ('24604', '24604', 'Северо-Кавказского федерального округа'),
#     'сибирский': ('12097', '12097', 'Сибирского федерального округа'),
#     'смоленская': ('67718', '21792', 'Смоленской области'),
#     'ставропольский': ('67654', '3086', 'Ставропольского края'),
#     'ставрополье': ('67654', '3086', 'Ставрополья'),  # Another version of 'ставропольский
#     'тамбовская': ('67725', '23909', 'Тамбовской области'),
#     'татарстан': ('67661', '6265', 'республики Татарстан'),
#     'тверская': ('67717', '21386', 'Тверской области'),
#     'томская': ('67692', '15593', 'Томской области'),
#     'тульская': ('67715', '21078', 'Тульской области'),
#     'тыва': ('67683', '12649', 'руспублики Тыва'),
#     'тува': ('67683', '12649', 'Тувы'),  # Another version of 'тыва
#     'тюменская': ('67697', '16507', 'Тюменской области'),
#     'удмуртская': ('67668', '9907', 'республики Удмуртия'),
#     'ульяновская': ('67660', '6097', 'Ульяновской области'),
#     'уральский': ('16333', '16333', 'Уральского федерального округа'),
#     'хабаровский': ('67707', '18540', 'Хабаровского края'),
#     'хакасия': ('67681', '12130', 'республики Хакасия'),
#     'ханты-мансийский': ('67695', '16334', 'Ханты-Мансийского автономного округа'),
#     'центральный': ('19099', '19099', 'Центрального федерального округа'),
#     'челябинская': ('67700', '17380', 'Челябинской области'),
#     'чеченская': ('67650', '2136', 'Чеченской республики'),
#     'чечня': ('67650', '2136', 'Чечни'),  # Another version of 'чеченская
#     'чувашия': ('67664', '8208', 'Чувашии'),
#     'чувашская': ('67664', '8208', 'Чувашской республики'),
#     'чукотский': ('67640', '18184', 'Чукотского автономного округа'),
#     'югра': ('67695', '16334', 'Югры'),
#     'южный': ('3', '3', 'Южного федерального округа'),
#     'якутия': ('67642', '17699', 'Якутии'),
#     'ямало-ненецкий': ('67696', '16448', 'Ямало-Ненецкого автономного округа'),
#     'ярославская': ('67713', '20670', 'Ярославской области')}
#
#
# for key, value in PLACES.items():
#     # print(key, value[0])
#     v = Value.create(nvalue=key, fvalue=value[0])
#     Dimension_Value.create(value=v, dimension=dim_t)
#
#
# with open('marks.csv') as file:
#     lines = file.readlines()
#     for line in lines:
#         l = re.sub('[()+/,]', '', line)
#         l = l.lower().replace('\n', '').split(';')
#         l[1] = l[1].replace('-', '')
#         v = Value.create(nvalue=l[1], fvalue=l[0])
#         Dimension_Value.create(value=v, dimension=dim_marks)
#         # print(l[1], l[0])
#
# with open('bglevels.csv') as file:
#     lines = file.readlines()
#     for line in lines:
#         l = re.sub('[()+/,]', '', line)
#         l = l.lower().replace('\n', '').split(';')
#         v = Value.create(nvalue=l[1], fvalue=l[0])
#         Dimension_Value.create(value=v, dimension=dim_bg)
#         # print(l[1], l[0])
#
# with open('rzpr.csv') as file:
#     lines = file.readlines()
#     for line in lines:
#         l = re.sub('[()+/,]', '', line)
#         l = l.lower().replace('\n', '').split(';')
#         v = Value.create(nvalue=l[2], fvalue=l[0])
#         Dimension_Value.create(value=v, dimension=dim_rzpr)
#         # print(l[2], l[0])
